Revit 2024 API
DocumentPrintingEventArgs Methods
The DocumentPrintingEventArgs type exposes the following members.
Methods
Name | Description
Cancel
 When the event is cancellable, may call the Cancel() method to cancel it.
 (Inherited from RevitAPIPreEventArgs.)
Dispose |  (Inherited from RevitAPIEventArgs.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSettings
 Gets the print settings of the active printing session.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetViewElementIds
 Returns ElementIds of the views to be printed.
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from RevitAPIEventArgs.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DocumentPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace